---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MayUnjoinRailAndSupports
source: html/62728a84-38fa-394b-3dba-51010319507f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MayUnjoinRailAndSupports Property

Fillet may cause the supports unjoin with the rail.

## Syntax (C#)
```csharp
public static FailureDefinitionId MayUnjoinRailAndSupports { get; }
```